# VSCode 扩展列表备份
# 恢复命令（PowerShell）：Get-Content extensions.txt | Where-Object { $_ -and $_ -notmatch "^#" } | ForEach-Object { code --install-extension $_ }
# 恢复命令（Bash）：grep -v "^#" extensions.txt | grep -v "^$" | xargs -L 1 code --install-extension

1yib.rust-bundle
bazelbuild.vscode-bazel
chaofan.hoi4modutilities
christian-kohler.npm-intellisense
codeium.codeium
colourafredi.vscode-deepseek
cweijan.vscode-office
dart-code.dart-code
dart-code.flutter
docker.docker
drblury.protobuf-vsc
dustypomerleau.rust-syntax
fill-labs.dependi
franneck94.c-cpp-runner
genieai.chatgpt-vscode
github.copilot
github.copilot-chat
golang.go
gongfeng.gongfeng-copilot
hdevalke.rust-test-lens
jeff-hykin.better-cpp-syntax
mjcrouch.perforce
mqycn.huile8
ms-azuretools.vscode-azure-github-copilot
ms-azuretools.vscode-azure-mcp-server
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-zh-hans
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vscode.powershell
ms-vscode.remote-explorer
ms-windows-ai-studio.windows-ai-studio
oderwat.indent-rainbow
rust-lang.rust-analyzer
shd101wyy.markdown-preview-enhanced
stuartwang.luapanda
sumneko.lua
tabnine.tabnine-vscode
tamasfe.even-better-toml
tomoki1207.pdf
twxs.cmake
vadimcn.vscode-lldb
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
xuedao.super-translate
yinfei.luahelper
zxh404.vscode-proto3
